DatanoiseTV/esp-smoltcp/examples/eth_basic/sdkconfig.defaults
# ESP32-P4 with built-in EMAC + IP101 PHY (Waveshare P4-Nano default).
# Adjust pins/PHY for your board.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# esp_smoltcp tuning (see component Kconfig for the full menu)
CONFIG_NETSTACK_DHCPV4_CLIENT=y
CONFIG_LWIP_COMPAT_ENABLE=y
# v0.2+ supports CONFIG_VFS_SUPPORT_SELECT=y (the default). The shim
# registers its own VFS for the BSD-socket FD range, overriding lwIP's.

# Disable lwIP IPv6 / autoIP — unreachable at runtime anyway via the wraps.
CONFIG_LWIP_AUTOIP=n
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_NETIF_LOOPBACK=y  # esp_http_server's control-socket check

# Skip runtime assertions on the data-plane hot path
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

# 1 kHz FreeRTOS tick — drops the floor on select() tail latency and
# the per-tick granularity of vTaskDelay-bounded waits everywhere.
CONFIG_FREERTOS_HZ=1000

# ETH driver tuning. RX > 15 is the gate for SOFT_FLOW_CONTROL, and the
# bigger TX queue avoids back-pressure stalls during burst sends.
CONFIG_ETH_DMA_RX_BUFFER_NUM=30
CONFIG_ETH_DMA_TX_BUFFER_NUM=30

# Software flow control: when the RX ring is filling up, the MAC driver
# drops the lowest-priority frames to keep the queue healthy. Combined
# with the hardware PAUSE-frame flow control we enable from app code
# (esp_eth_ioctl ETH_CMD_S_FLOW_CTRL), this keeps the link clean under
# sustained load.
CONFIG_ETH_SOFT_FLOW_CONTROL=y

# Pin ETH RX/TX hot path into IRAM — direct throughput win.
CONFIG_ETH_IRAM_OPTIMIZATION=y
